blog-app/app/models/article.rb

    def tag_list=(tag_strings)
        tag_names=tag_strings.split(",").collect{|s| s.strip.downcase}.uniq
        new_or_found_tags=tag_names.collect{|s| Tag.find_or_create_by(name: s)}
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "killings"], ["created_at", "2020-10-13 14:03:00.895488"], ["updated_at", "2020-10-13 14:03:00.895488"]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "killings"], ["LIMIT", 1]]