blog-app/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "End sars"], ["body", "Protest"], ["created_at", "2020-10-13 15:39:26.845371"], ["updated_at", "2020-10-13 15:39:26.845371"]]
---
    def create
        @article=Article.new(params_helper)
        @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "toyota"], ["updated_at", "2020-10-12 14:53:17.233679"], ["id", 2]]
---
    def update
        @article = Article.find(params[:id])
        @article.update(params_helper)