app/controllers/comments_controller.rb

    def create
        @comment=Comment.new(comments_helper)
        @comment.article_id=params[:article_id]
        @comment.save
---
INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "Grace"], ["body", "I love dancing"], ["article_id", 1], ["created_at", "2020-10-13 12:46:26.214491"], ["updated_at", "2020-10-13 12:46:26.214491"]]